app/views/favorites/_favorite-btn.html.erb

         <%= link_to book_favorites_path(book), method: :delete, remote: true do %>
          ♥<%= book.favorites.count %>いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 45]]

           <%= link_to book_favorites_path(book), method: :post, remote: true do %>
            ♡<%= book.favorites.count %>いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 44]]