app/views/book_comments/_comment-index.html.erb

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 46]]
---
<table class = "table table-border" >
  <% book.book_comments.each do |book_comment| %>