app/views/books/index.html.erb


          <td><span>コメント件数<%= book.book_comments.count %></span></td>
---
SELECT "books".* FROM "books" ORDER BY "books"."created_at" DESC
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 45]]