app/views/books/show.html.erb


        <td><span>コメント件数<%= @book.book_comments.count %></span></td>
---
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 45]]