app/controllers/books_controller.rb

  def index
    @book= Book.new
    @books= Book.all
---
SELECT "books".* FROM "books" ORDER BY "books"."created_at" DESC

  def create
    @books= Book.all
    @user= current_user

    @book= Book.new(book_params)
    @book.user_id = current_user.id
  if @book.save
---
SELECT "books".* FROM "books"
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "sss"], ["body", "szss"], ["user_id", 12], ["created_at", "2021-02-15 15:40:33.647562"], ["updated_at", "2021-02-15 15:40:33.647562"]]

  def show
    @book1= Book.new
    @book= Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]

  def ensure_current_user
    @book= Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 44], ["LIMIT", 1]]