app/controllers/users_controller.rb

  def index
    @book = Book.new
    @users = User.all
---
SELECT "users".* FROM "users"

  def create
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def show
    @book1 = Book.new

    @user = User.find(params[:id])
    @books = @user.books.order(created_at: :desc)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ? ORDER BY "books"."created_at" DESC  [["user_id", 12]]

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", nil], ["updated_at", "2021-05-04 10:08:32.137896"], ["id", 12]]