app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
  def followed_by?(user)
    followed.where(follower_id: user.id).present?